### Forest: Lotus Mainnet Infrastructure Plan: success

<details><summary>Show Plan</summary>

```
module.lotus-mainnet.data.digitalocean_ssh_keys.keys: Reading...
module.lotus-mainnet.data.digitalocean_project.forest_project: Reading...
module.lotus-mainnet.digitalocean_volume.forest_volume[0]: Refreshing state... [id=e6a5dbee-39b4-11ee-a225-0a58ac14d046]
module.lotus-mainnet.data.digitalocean_ssh_keys.keys: Read complete after 0s [id=ssh_keys/4003270040538543685]
module.lotus-mainnet.digitalocean_droplet.forest: Refreshing state... [id=369736649]
module.lotus-mainnet.digitalocean_firewall.forest_firewall: Refreshing state... [id=8ef85851-bfa2-42b0-a7f5-c51714846157]
module.lotus-mainnet.digitalocean_volume_attachment.forest_volume[0]: Refreshing state... [id=369736649-e6a5dbee-39b4-11ee-a225-0a58ac14d046-20230813084037300700000001]
module.lotus-mainnet.data.digitalocean_project.forest_project: Read complete after 2s [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
module.lotus-mainnet.digitalocean_project_resources.connect_forest_project: Refreshing state... [id=da5e6601-7fd9-4d02-951e-390f7feb3411]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lotus-mainnet.digitalocean_droplet.forest must be replaced
-/+ resource "digitalocean_droplet" "forest" {
      ~ created_at           = "2023-08-13T08:39:21Z" -> (known after apply)
      ~ disk                 = 320 -> (known after apply)
      ~ id                   = "369736649" -> (known after apply)
      ~ image                = "docker-20-04" -> "s-8vcpu-16gb" # forces replacement
      ~ ipv4_address         = "165.227.164.32" -> (known after apply)
      ~ ipv4_address_private = "10.135.0.4" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 16384 -> (known after apply)
        name                 = "lotus-mainnet"
      ~ price_hourly         = 0.14286 -> (known after apply)
      ~ price_monthly        = 96 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ size                 = "s-8vcpu-16gb" -> "s-4vcpu-8gb"
      ~ status               = "active" -> (known after apply)
        tags                 = [
            "mainnet",
        ]
      ~ urn                  = "do:droplet:369736649" -> (known after apply)
      ~ user_data            = "900c459cf76bd0a53c933a61b017d9089149e472" -> "e1414e4a5bbf153bb11b5babaac29915539011f4" # forces replacement
      ~ vcpus                = 8 -> (known after apply)
      ~ volume_ids           = [
          - "e6a5dbee-39b4-11ee-a225-0a58ac14d046",
        ] -> (known after apply)
      ~ vpc_uuid             = "46a525ac-fd37-47ea-bb10-95c1db0055f7" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.lotus-mainnet.digitalocean_firewall.forest_firewall will be updated in-place
  ~ resource "digitalocean_firewall" "forest_firewall" {
      ~ droplet_ids     = [
          - 369736649,
        ] -> (known after apply)
        id              = "8ef85851-bfa2-42b0-a7f5-c51714846157"
        name            = "lotus-mainnet-fw"
        tags            = [
            "mainnet",
        ]
        # (3 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.lotus-mainnet.digitalocean_project_resources.connect_forest_project will be updated in-place
  ~ resource "digitalocean_project_resources" "connect_forest_project" {
        id        = "da5e6601-7fd9-4d02-951e-390f7feb3411"
      ~ resources = [
          - "do:droplet:369736649",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.lotus-mainnet.digitalocean_volume_attachment.forest_volume[0] must be replaced
-/+ resource "digitalocean_volume_attachment" "forest_volume" {
      ~ droplet_id = 369736649 # forces replacement -> (known after apply) # forces replacement
      ~ id         = "369736649-e6a5dbee-39b4-11ee-a225-0a58ac14d046-20230813084037300700000001" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>